"""
Разклонени алгоритми. Условен оператор

1. Въведение

Задача 1:
Да се напише програма, която въвежда от клавиатурата реално число r.
Програмата да изчисли и отпечата периметъра на окръжност с радиус r.

Преди да усвоим знания за разклонени алгоритми, кодът изглежда така:

const double PI = 3.14
p = 2 * PI * r
print(p)

Но... всеки алгоритъм трябва да е напълно коректен и да извежда верни резултати за различни входни данни.

Представете си, че за стойност на радиуса бъде въведено отрицателно число.
Тогава получената обиколка би било също отрицателно число, което е безсмислено в геометрията.

Подобни изчисления са недопустими.

За да е прецизно решението, е необходимо да се направи проверка дали въведената стойност е коректна.

Ако радиусът е положителен — изчисляваме обиколката.
Ако не е — програмата трябва да изведе съобщение за грешка.

Такъв тип проверка се нарича разклонен алгоритъм.

Алгоритъм, чието изпълнение се разделя на различни последователности от действия
в зависимост от дадено условие, се нарича разклонен алгоритъм.
"""
