"""
Задача 4

Да се състави програма, която въвежда последователно от клавиатурата три реални числа
и извежда най-голямото от тях.

Описание на алгоритъма:
1. Създава се помощна променлива max.
2. max се инициализира с първото въведено число.
3. Второто число се сравнява с max — ако е по-голямо, max приема неговата стойност.
4. Третото число се сравнява с max — ако е по-голямо, max приема неговата стойност.
5. Извежда се стойността на max като най-голямото число.

Примери:
- Вход: 28 771 65 → Изход: 771
- Вход: -3 -25 -21 → Изход: -3
"""
# Задача 3 — Решение в Python

# Въвеждане на първото число
x = float(input("Въведете първото число: "))
max_num = x

# Въвеждане и сравнение с второто число
x = float(input("Въведете второто число: "))
if x > max_num:
    max_num = x

# Въвеждане и сравнение с третото число
x = float(input("Въведете третото число: "))
if x > max_num:
    max_num = x

# Извеждане на най-голямото число
print("Най-голямото число е:", max_num)
