"""
Задача: Изчисляване на периметъра на окръжност с радиус r.

Условие:
Програмата въвежда от клавиатурата реално число r.
Ако r е положително, програмата изчислява и извежда периметъра на окръжността (P = 2 * PI * r).
Ако r е отрицателно или 0, програмата извежда съобщение "Некоректни данни!".

Примери:
- Вход: r = 12.5 → Изход: P = 78.5
- Вход: r = -3.1 → Изход: Некоректни данни!
"""
# Задача  — Решение в Python с проверка за коректност на радиуса

# Въвеждане на радиуса
r = float(input("Въведете радиус r: "))

# Проверка дали радиусът е коректен
if r > 0:
    PI = 3.14
    p = 2 * PI * r
    print("Периметърът е:", p)
else:
    print("Некоректни данни!")
