"""
Задача 2

Да се състави програма, която въвежда от клавиатурата две различни реални числа.
Програмата да изведе по-голямото от тях.

Пример:
Вход: a = 5.4, b = 7.2
Изход: 7.2
"""
# Задача 2 — Решение в Python

# Въвеждане на двете реални числа
a = float(input("Въведете число a: "))
b = float(input("Въведете число b: "))

# Сравнение и извеждане на по-голямото
if a > b:
    print("По-голямото е:", a)
else:
    print("По-голямото е:", b)
