"""
Задача 7

Да се състави програма за намиране на корените на уравнението:

ax^2 + bx + c = 0

Коефициентите a, b и c се въвеждат от клавиатурата на един ред, разделени с интервал.

На изхода да се извежда подходящо съобщение според решението на уравнението:

- Ако a = 0 → преминава се към линейно уравнение bx + c = 0
- Ако и b = 0 → уравнението става c = 0 → или "Всяко x е решение", или "Няма решение"
- При a ≠ 0 → се изчислява дискриминантата D = b² - 4ac:
  - Ако D ≥ 0 → извеждаме двата реални корена
  - Ако D < 0 → "Няма реални корени"
"""


# Задача 7 — Решение в Python

import math

# Въвеждане на коефициентите a, b и c
a, b, c = map(float, input("Въведете a, b и c (разделени с интервал): ").split())

if a == 0:
    # Уравнението става линейно: bx + c = 0
    if b == 0:
        if c == 0:
            print("Всяко x е решение")
        else:
            print("Няма решение")
    else:
        x = -c / b
        print(f"Решение: x = {x}")
else:
    # Квадратно уравнение
    d = b**2 - 4*a*c
    if d >= 0:
        x1 = (-b + math.sqrt(d)) / (2 * a)
        x2 = (-b - math.sqrt(d)) / (2 * a)
        print(f"x1 = {x1}  x2 = {x2}")
    else:
        print("Няма реални корени")
