"""
Задача 4

Да се състави програма, която въвежда от клавиатурата три реални числа x, y и z
и ги сортира във възходящ ред.

Въвеждането на числата става на един ред, разделени с интервал.
Сортираните числа се извеждат на един ред, също разделени с интервал.

За решението на задачата се използват поредици от размени на стойностите на променливите.

Примери:
Вход: 31 15 5 → Изход: 5 15 31
Вход: -4 -19 -10 → Изход: -19 -10 -4
"""
# Въвеждане на трите числа поотделно
x = float(input("Въведете първото число: "))
y = float(input("Въведете второто число: "))
z = float(input("Въведете третото число: "))

# Сортиране чрез размени
if x > y:
    x, y = y, x
if x > z:
    x, z = z, x
if y > z:
    y, z = z, y


# Извеждане на подредените числа
print(x, y, z)
