"""
Задача 6

Да се състави програма, която определя в кой квадрант лежи точката A с координати (x, y).
Да се извежда съобщение с номера на квадранта.

Предполага се, че точката A не лежи на никоя от координатните оси.

Квадрантите са:
- I квадрант → x > 0 и y > 0
- II квадрант → x < 0 и y > 0
- III квадрант → x < 0 и y < 0
- IV квадрант → x > 0 и y < 0
"""
# Задача 6 — Решение в Python

# Въвеждане на координатите на точката
x = float(input("Въведете x: "))
y = float(input("Въведете y: "))

# Определяне на квадранта
if x > 0:
    if y > 0:
        print("Квадрант I")
    else:
        print("Квадрант IV")
else:
    if y > 0:
        print("Квадрант II")
    else:
        print("Квадрант III")
